package human0;

public class List_Ex01 {
/*
	EX01
		1	
			1		변수선언
			2		데이터 타입
			3		문자열, 증감연산자
			4		증감연산자
		2
			1		타입별 출력
			2		연산우선순위(대입)
			3		증감연산자
			4		관계연산자
			5		관계, 논리연산자
			6		Scanner, 논리연산자
			7		조건연산자
		3
			1		if문
			2		if문
			3_1		if문(여러개)
			3_2		if ~ else문
			4		다중 if ~ else문
			5_1		if ~ else if문
			5_2		switch문
		4
			1		while문
			2		do ~ while문
			3		for 문
			4		while, break문
			5_1		whlie, if, continue문(홀수만-나머지)
			5_2		whlie, if(홀수만-나머지)
		5
			1		구구단 5단 출력(Scan)
			2		입력한 구구구단 출력
			3		1~9단 출력(for문)
			4		1~9단 출력(while문)
			5		홀수단 출력
			6		3의배수 총합 출력
			7		주사위 눈(랜덤)
			8		4x + 5y == 60인 정수 x,y의 값을 출력
			9_1		별찍기 1
			9_2		별찍기 2
			9_3		별찍기 3
			9_4		별찍기 4
			9_5(임의)별찍기 총합
			10		1.예금 | 2.출금 | 3.잔고 | 4.종료
			11		break와 continue 문법에 대한 이해.
		6
			1		메서드를 만들어 사용
			2		메서드를 만들어 사용(사칙연산 수행)
		7
			1		boolean 사용
			2		1차 배열
			3		2차 배열
			3_1		배열 초기화
			4		p.181(5장) 연습문제 7. 최대값 구하기
			5		p.181(5장) 연습문제 7. 최소값 구하기
			6		다차원 배열
			7(임의)	배열을 이용한 별찍기(패턴)
			8		최대, 최소, 합계 구하는 프로그램(함수 이용)
			9		1. 학생수 | 2. 점수입력 | 3. 점수리스트 | 4. 분석 | 5. 종료 / 배열 null값에 덮어씌우기
		8
			1		week 사용
*/

}
