package human0;

public class List_Ex03 {
/*	
	EX03
		1		상속 extends
		2		상속 - 생성자 호출 순서
		2_1		상속 - super 생략
		2_2		상속 - 이중상속(3층 구조)
		3		메서드 오버라이딩	
		3_1		super.method()로 오버라이딩된 부모 메서드 사용가능 
		4		상속 - protected (다른 패키지, 다른 클래스) 접근자
		5		상속 - 다형성 1
		6		상속 - 다형성 2  // 메소드명이 같아도 받는 인자가 다르면 다른 메소드 취급
		7		상송 - 강제적타입변환(casting) - 자식 클래스에 있는 메서드 변수를 사용하기 위함, 
						변환전 instanceof 이용하여 상속 관계 체크
		8		7장 연습문제 5
		9		7장 연습문제 6
		10		7장 연습문제 7
		11		강의4 예제(Exam_06-1 실습) **
		12		추상 클래스 1
		13		추상 클래스 2
		14		추상 클래스 - 도형 넓이
		15		추상 클래스 - 다형성 - 타입변환
		16		추상 클래스 - 계층
		17		추상 클래스 - 템플릿 메서드, 프레임 워크 개념
*/
}
